{
    "checksum": "13c83c976abc596b9d74b3ce095121be9ec4eb775a0bac9098c06be5f891cddd",
    "blogs": [
        {
            "title": "Project Update: OOTD (Recent Developments)",
            "excerpt": "Progress has picked up again on OOTD, with several key milestones achieved over the past few weeks. For those unfamiliar, OOTD is a Blogging platform, mashing together short form\/ephemeral micro blogging, long form written content and the killer feature of acting like inventory management system for your wardrobe, giving daily insights on trends and how you use your wardrobe. All that while giving users the tools to shape their public profile and posts the way they want, encouraging individual creativity.",
            "thumbnail": "Screenshot-2025-01-25-at-21.48.09-png-e1737841806929.avif",
            "date": "2025-01-25",
            "path": "\/blogs\/20250125\/project-update-ootd\/"
        },
        {
            "title": "Spam is for sandwiches, not SEO",
            "excerpt": "1.4 gigabytes of spam came through my comments on the 10th of this month. Which is very frustrating because I like having comments enabled, when I was a teenager and learning to program(programme?) I would use blog comments all the time. What did I do?I enabled rate limiting and the cloudflare captcha on post, what",
            "thumbnail": "Screenshot-2025-01-25-at-21.48.09-png-e1737841806929.avif",
            "date": "2024-11-28",
            "path": "\/blogs\/20241128\/spam-is-for-sandwiches\/"
        },
        {
            "title": "Inventory management, but it’s fashion, and its social!?",
            "excerpt": "OOTD(working title) is essentially an inventory management system skinned for fashionistas like moi with social elements.except I’m building this just for me and for fun, so follow the progress on GitHub and twitter and here, errrm. I plan to build a functioning prototype, invite people, and continue adding features until I get bored. Core functionality",
            "thumbnail": "Screenshot-2025-01-25-at-21.48.09-png-e1737841806929.avif",
            "date": "2024-11-09",
            "path": "\/blogs\/20241109\/inventory-management\/"
        }
    ]
}